app/controllers/sessions_controller.rb

  def create # rubocop:disable Metrics/MethodLength
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@gmail.com' LIMIT 1